## Encodage One-Hot (One-Hot Encoding)

In [1]:
import pandas as pd

# Création d'un DataFrame avec une variable catégorielle nominale
data = {
    'Couleur': ['Rouge', 'Bleu', 'Vert', 'Bleu', 'Rouge', 'Vert'],
    'Prix': [10, 15, 10, 20, 25, 15]
}

In [3]:
df = pd.DataFrame(data)

In [4]:
df

  Couleur  Prix
0   Rouge    10
1    Bleu    15
2    Vert    10
3    Bleu    20
4   Rouge    25
5    Vert    15

In [7]:
# Application du One-Hot Encoding
df_encoded = pd.get_dummies(df, columns=['Couleur'], drop_first=True, dtype= int)
df_encoded

   Prix  Couleur_Rouge  Couleur_Vert
0    10              1             0
1    15              0             0
2    10              0             1
3    20              0             0
4    25              1             0
5    15              0             1

## Encodage ordinal

In [8]:
from sklearn.preprocessing import OrdinalEncoder

# Création d'un DataFrame avec une variable catégorielle ordinale
data = {
    'Niveau': ['Faible', 'Moyen', 'Élevé', 'Faible', 'Élevé'],
    'Score': [30, 50, 80, 40, 90]
}

df = pd.DataFrame(data)

In [9]:
df

   Niveau  Score
0  Faible     30
1   Moyen     50
2   Élevé     80
3  Faible     40
4   Élevé     90

In [10]:
encoder = OrdinalEncoder(categories=[['Faible', 'Moyen', 'Élevé']])
df['Niveau_encoded'] = encoder.fit_transform(df[['Niveau']])

In [11]:
df

   Niveau  Score  Niveau_encoded
0  Faible     30             0.0
1   Moyen     50             1.0
2   Élevé     80             2.0
3  Faible     40             0.0
4   Élevé     90             2.0

## Target encoding

In [18]:
import numpy as np

# Création d'un DataFrame avec une variable catégorielle et une cible
data = {
    'Ville': ['Paris', 'Lyon', 'Marseille', 'Lyon', 'Paris', 'Marseille'],
    'Prix_moyen': [300, 200, 250, 180, 320, 260]
}

df = pd.DataFrame(data)

In [19]:
df

       Ville  Prix_moyen
0      Paris         300
1       Lyon         200
2  Marseille         250
3       Lyon         180
4      Paris         320
5  Marseille         260

In [20]:
df['Ville_encoded'] = df.groupby('Ville')['Prix_moyen'].transform('mean')

In [21]:
df

       Ville  Prix_moyen  Ville_encoded
0      Paris         300          310.0
1       Lyon         200          190.0
2  Marseille         250          255.0
3       Lyon         180          190.0
4      Paris         320          310.0
5  Marseille         260          255.0